{
    "_class_name": "LDMPipeline",
    "_diffusers_version": "0.2.2",
    "scheduler": [
      "diffusers",
      "DDIMScheduler"
    ],
    "unet": [
      "diffusers",
      "UNet2DModel"
    ],
    "vqvae": [
      "diffusers",
      "AutoencoderKL"
    ]
  }